-- количество исполнителей в каждом жанре;
-- количество треков, вошедших в альбомы 2019-2020 годов;
-- средняя продолжительность треков по каждому альбому;
-- все исполнители, которые не выпустили альбомы в 2020 году;
-- названия сборников, в которых присутствует конкретный исполнитель (выберите сами);
-- название альбомов, в которых присутствуют исполнители более 1 жанра;
-- наименование треков, которые не входят в сборники;
-- исполнителя(-ей), написавшего самый короткий по продолжительности трек (теоретически таких треков может быть несколько);
-- название альбомов, содержащих наименьшее количество треков.

SELECT name, COUNT(artist_id) FROM Genre
JOIN GenreArtists ON genre.id = GenreArtists.genre_id
GROUP BY genre.name;

SELECT name, COUNT(id) FROM Track
JOIN Album ON Track.id = Album.id
WHERE year BETWEEN 2019 AND 2020